А вот что вы будете использовать в работе
DevTools
Charles
Figma
Яндекс.Трекер
Android Studio
Postman
JavaScript
JSON/XML
XML/XSD
Apidoc/Swagger
SQL
Cygwin/Terminal
Начните зарабатывать, тестируя
Вы начнёте с junior-позиции, а дальше — только вперёд. Будете шагать по карьерной лестнице и расти в цене. И однажды цены вам не будет.

Источник данных: Хабр Карьера
50 000 ₽
Junior тестировщик
97 000 ₽
Middle тестировщик
130 000 ₽ +
Senior тестировщик
Что именно вы будете делать, когда станете инженером по тестированию

Тестировать веб- и мобильные приложения, API

Проектировать тесты и проверять сервисы

Создавать надёжный продукт вместе с командой

Помогать бизнесу развиваться, а пользователям — решать их задачи
Тысячи студентов Практикума
освоили новую профессию — и вы освоите
Истории выпускников, которые уже занимаются любимым делом